![NYC Skyline](nyc.jpg)

Welcome to New York City, one of the most-visited cities in the world. There are many Airbnb listings in New York City to meet the high demand for temporary lodging for travelers, which can be anywhere between a few nights to many months. In this project, we will take a closer look at the New York Airbnb market by combining data from multiple file types like `.csv`, `.tsv`, and `.xlsx`.

Recall that **CSV**, **TSV**, and **Excel** files are three common formats for storing data. 
Three files containing data on 2019 Airbnb listings are available to you:

**data/airbnb_price.csv**
This is a CSV file containing data on Airbnb listing prices and locations.
- **`listing_id`**: unique identifier of listing
- **`price`**: nightly listing price in USD
- **`nbhood_full`**: name of borough and neighborhood where listing is located

**data/airbnb_room_type.xlsx**
This is an Excel file containing data on Airbnb listing descriptions and room types.
- **`listing_id`**: unique identifier of listing
- **`description`**: listing description
- **`room_type`**: Airbnb has three types of rooms: shared rooms, private rooms, and entire homes/apartments

**data/airbnb_last_review.tsv**
This is a TSV file containing data on Airbnb host names and review dates.
- **`listing_id`**: unique identifier of listing
- **`host_name`**: name of listing host
- **`last_review`**: date when the listing was last reviewed

As a consultant working for a real estate start-up, you have collected Airbnb listing data from various sources to investigate the short-term rental market in New York. You'll analyze this data to provide insights on private rooms to the real estate company.

There are three files in the data folder: airbnb_price.csv, airbnb_room_type.xlsx, airbnb_last_review.tsv.

In [1]:
# Import necessary packages
import pandas as pd
import numpy as np

# Begin coding here ...
# Use as many cells as you like

In [6]:
airbnb_price = pd.read_csv('data//airbnb_price.csv')
airbnb_price

       listing_id        price                 nbhood_full
0            2595  225 dollars          Manhattan, Midtown
1            3831   89 dollars      Brooklyn, Clinton Hill
2            5099  200 dollars      Manhattan, Murray Hill
3            5178   79 dollars   Manhattan, Hell's Kitchen
4            5238  150 dollars        Manhattan, Chinatown
...           ...          ...                         ...
25204    36425863  129 dollars  Manhattan, Upper East Side
25205    36427429   45 dollars            Queens, Flushing
25206    36438336  235 dollars  Staten Island, Great Kills
25207    36442252  100 dollars           Bronx, Mott Haven
25208    36455809   30 dollars          Brooklyn, Bushwick

[25209 rows x 3 columns]

In [9]:
airbnb_last_review = pd.read_csv('data//airbnb_last_review.tsv', sep='\t')
airbnb_last_review

       listing_id    host_name   last_review
0            2595     Jennifer   May 21 2019
1            3831  LisaRoxanne  July 05 2019
2            5099        Chris  June 22 2019
3            5178     Shunichi  June 24 2019
4            5238          Ben  June 09 2019
...           ...          ...           ...
25204    36425863        Rusaa  July 07 2019
25205    36427429         H Ai  July 07 2019
25206    36438336          Ben  July 07 2019
25207    36442252       Blaine  July 07 2019
25208    36455809    Christine  July 08 2019

[25209 rows x 3 columns]

In [11]:
airbnb_room_type = pd.read_excel('data//airbnb_room_type.xlsx')
airbnb_room_type

       listing_id                                 description        room_type
0            2595                       Skylit Midtown Castle  Entire home/apt
1            3831             Cozy Entire Floor of Brownstone  Entire home/apt
2            5099   Large Cozy 1 BR Apartment In Midtown East  Entire home/apt
3            5178             Large Furnished Room Near B'way     private room
4            5238          Cute & Cozy Lower East Side 1 bdrm  Entire home/apt
...           ...                                         ...              ...
25204    36425863  Lovely Privet Bedroom with Privet Restroom     PRIVATE ROOM
25205    36427429                    No.2 with queen size bed     PRIVATE ROOM
25206    36438336                             Seas The Moment     Private room
25207    36442252               1B-1B apartment near by Metro  Entire home/apt
25208    36455809     Cozy Private Room in Bushwick, Brooklyn     Private room

[25209 rows x 3 columns]

What are the dates of the earliest and most recent reviews? Store these values as two separate variables with your preferred names.

In [12]:
airbnb_last_review.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  int64
 1   host_name    25201 non-null  object
 2   last_review  25209 non-null  object
dtypes: int64(1), object(2)
memory usage: 591.0+ KB

In [22]:
airbnb_last_review['last_review_dt'] = pd.to_datetime(airbnb_last_review.last_review)
airbnb_last_review

       listing_id    host_name   last_review last_review_dt
0            2595     Jennifer   May 21 2019     2019-05-21
1            3831  LisaRoxanne  July 05 2019     2019-07-05
2            5099        Chris  June 22 2019     2019-06-22
3            5178     Shunichi  June 24 2019     2019-06-24
4            5238          Ben  June 09 2019     2019-06-09
...           ...          ...           ...            ...
25204    36425863        Rusaa  July 07 2019     2019-07-07
25205    36427429         H Ai  July 07 2019     2019-07-07
25206    36438336          Ben  July 07 2019     2019-07-07
25207    36442252       Blaine  July 07 2019     2019-07-07
25208    36455809    Christine  July 08 2019     2019-07-08

[25209 rows x 4 columns]

In [26]:
earliest_review = min(airbnb_last_review['last_review_dt'])
most_recent_review = max(airbnb_last_review['last_review_dt'])

earliest_review, most_recent_review

(Timestamp('2019-01-01 00:00:00'), Timestamp('2019-07-09 00:00:00'))

How many of the listings are private rooms? Save this into any variable.

In [27]:
airbnb_room_type.room_type.unique()

array(['Entire home/apt', 'private room', 'Private room',
       'entire home/apt', 'PRIVATE ROOM', 'shared room',
       'ENTIRE HOME/APT', 'Shared room', 'SHARED ROOM'], dtype=object)

In [31]:
airbnb_room_type.room_type.str.lower().unique()

array(['entire home/apt', 'private room', 'shared room'], dtype=object)

In [33]:
airbnb_room_type['room_type'] = airbnb_room_type.room_type.str.lower()
airbnb_room_type.room_type.unique()

array(['entire home/apt', 'private room', 'shared room'], dtype=object)

In [42]:
num_private_rooms = airbnb_room_type.room_type.value_counts()['private room']
num_private_rooms

11356

What is the average listing price? Round to the nearest two decimal places and save into a variable.

In [57]:
airbnb_price['price_int'] = airbnb_price.price.str.split(' ', n=1).str[0].astype(int)
airbnb_price

       listing_id        price                 nbhood_full  price_int
0            2595  225 dollars          Manhattan, Midtown        225
1            3831   89 dollars      Brooklyn, Clinton Hill         89
2            5099  200 dollars      Manhattan, Murray Hill        200
3            5178   79 dollars   Manhattan, Hell's Kitchen         79
4            5238  150 dollars        Manhattan, Chinatown        150
...           ...          ...                         ...        ...
25204    36425863  129 dollars  Manhattan, Upper East Side        129
25205    36427429   45 dollars            Queens, Flushing         45
25206    36438336  235 dollars  Staten Island, Great Kills        235
25207    36442252  100 dollars           Bronx, Mott Haven        100
25208    36455809   30 dollars          Brooklyn, Bushwick         30

[25209 rows x 4 columns]

In [60]:
aver_price_list = np.round(airbnb_price['price_int'].mean(), 2)
aver_price_list

141.78

Combine the new variables into one DataFrame called review_dates with four columns in the following order: first_reviewed, last_reviewed, nb_private_rooms, and avg_price. The DataFrame should only contain one row of values.

In [72]:
data = {
    'first_reviewed': [earliest_review],
    'last_reviewed': [most_recent_review],
    'nb_private_rooms': [num_private_rooms],
    'avg_price': [aver_price_list]
}

review_dates = pd.DataFrame(data)
review_dates

  first_reviewed last_reviewed  nb_private_rooms  avg_price
0     2019-01-01    2019-07-09             11356     141.78